-- задание 1
SELECT "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" as "Н_ТИПЫ_ВЕДОМОСТЕЙ ИД", "Н_ВЕДОМОСТИ"."ИД" as "Н_ВЕДОМОСТИ ИД"
from "Н_ТИПЫ_ВЕДОМОСТЕЙ"
         INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ТВ_ИД" = "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД"
WHERE "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" < "Перезачет"
  AND "Н_ВЕДОМОСТИ".ЧЛВК_ИД < 105590;

-- задание 2
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.НАЧАЛО
FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
LEFT JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИД < 152862
AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД < 113409
AND Н_УЧЕНИКИ.ИД < 150308;