-- задание 1
EXPLAIN ANALYZE
SELECT "ФАМИЛИЯ", "ДАТА"
FROM "Н_ЛЮДИ"
         LEFT JOIN "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "ЧЛВК_ИД"
WHERE "ОТЧЕСТВО" > 'Сергеевич'
  AND "Н_ВЕДОМОСТИ"."ИД" = 1250972
  AND "Н_ВЕДОМОСТИ"."ИД" = 1490007;

-- задание 2
EXPLAIN ANALYZE
SELECT "Н_ЛЮДИ"."ИД", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."НАЧАЛО"
FROM "Н_ЛЮДИ"
         LEFT JOIN "Н_ОБУЧЕНИЯ" on "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         LEFT JOIN "Н_УЧЕНИКИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" < 'Афанасьев'
  AND "НЗК" = '001000';
